{
    "english": [
        {
            "headers": [
                {
                    "0": "Skills",
                    "1": "Projects",
                    "2": "About me",
                    "3": "Contact"
                }
            ],
            "reference": [
                {
                    "0": "skills",
                    "1": "projects",
                    "2": "about",
                    "3": "contact"
                }
            ],
            "title": [
                {
                    "0": [
                        {
                            "0": "Front End",
                            "1": "Developer"
                        }
                    ],
                    "1": [
                        {
                            "0": "Luc",
                            "1": "Zuidema"
                        }
                    ]
                }
            ],
            "skills": [
                {
                    "reference": [
                        {
                            "0": "html",
                            "1": "css",
                            "2": "Java script",
                            "3": "Scss",
                            "4": "Php"
                        }
                    ],
                    "image": [
                        {
                            "0": "./img/html.png",
                            "1": "./img/css.png",
                            "2": "./img/js.png",
                            "3": "./img/scss.png",
                            "4": "./img/php.png"
                        }
                    ],
                    "text": [
                        {
                            "0": "I possess advanced HTML skills, emphasizing semantic HTML, BEM naming for maintainable code, SEO optimization, and web accessibility compliance. I excel in responsive design, cross-browser compatibility, and version control, making me a valuable asset for visually appealing, accessible, and SEO-friendly web development",
                            "1": "I possess advanced CSS skills, including clean and modular code, expertise in responsive design, and knowledge of CSS methodologies like BEM. I'm experienced with CSS pre-processors like SASS/SCSS, enhancing productivity, and prioritize web accessibility and adherence to WCAG standards for creating visually appealing, user-friendly, and responsive web interfaces.",
                            "2": "My JavaScript skills include strong Object-Oriented Programming (OOP) expertise for well-structured code. I excel in rendering with libraries like React, handle JSON-based APIs, and prioritize reusable code for efficient, data-driven, and interactive web applications",
                            "3": "My SCSS expertise enhances CSS, allowing me to create efficient and maintainable styles. Features like variables, nesting, mixins, and inheritance enable cleaner and organized code. This optimization streamlines development, producing visually appealing and scalable web interfaces.",
                            "4": "I'm on a journey to become proficient in PHP, currently in the training phase with a deep enthusiasm for learning. My foundational knowledge in PHP equips me with essential concepts and syntax for web development. I'm committed to expanding my skills and eagerly look forward to harnessing PHP's potential for creating dynamic web applications. My learning journey in PHP is ongoing, and I'm excited about the opportunities for growth and mastery as I continue to evolve in this dynamic field"
                        }
                    ]
                }
            ],
            "projects": [
                {
                    "title": "projects",
                    "reference": [
                        {
                            "0": "collection of happines",
                            "1": "banky",
                            "2": "Cookie Clicker",
                            "3": "eduLock",
                            "4": "Doesburg Coaching"
                        }
                    ],
                    "image": [
                        {
                            "0": "./img/happines.png",
                            "1": "./img/banky.png",
                            "2": "./img/cookie.png",
                            "3": "",
                            "4": "./img/doesburg.png"
                        }
                    ],
                    "text": [
                        {
                            "0": "Collection of happiness is a project from period 2.3 where we were challenged to make a layout of multiple news articles where you could switch between them and download the corresponding audio and open the source of that article. Everything was rendered inside of JS OOP. The articles are chosen randomly from a pre determined set of articles to show a different featured article on every reload.",
                            "1": "Banky is a bank application where you can easily switch between accounts(i.e. different Datasets).  For this example there are two bank accounts (datasets) with a provided button for each account which is automatically created with the creation of a new account. There is also a blur button to make sure that any by passers cant see any critical information.",
                            "2": "Cookie clicker was my first project using OOP in JS. We learned how to make repeating objects and how to create classes while rendering all elements inside of JS. Each button has its own functionality and the peak of all is the save button which saves the current score and the used abilities inside the local storage to ensure the same score every time you load.",
                            "3": "EduLock is a new company founded by 4 friends. Currently we are working on collecting data for this projects and dividing tasks among the team. We consist out of 2 front-end developers and 2 back-end developers. Currently I’m a front-end developer and the project manager to ensure everyone is up to date with the current task at hand. We are not an official company yet. But soon we will hand in our idea at the KVK.",
                            "4": "Doesburg coaching was a projects designed for “Cindy Doesburg”. she has a company designed for helping workers to get out of burnouts or other mentals problems to get back into the working field. She gave four separate exercises she hands out on paper which she wanted “digitalized”. These were made in a group of four existing of Jacob, Milou, Nabil and Me(Luc). These were all made using the same coding style as cookie clicker and Banky using OOP and rendering items in JS. the above image is one of the four excersises we made"
                        }
                    ],
                    "link": [
                        {
                            "0": "https://github.com/Darkluc05/collection-of-happines",
                            "1": "https://github.com/Darkluc05/Programming-2.3/tree/main/les7-8%20-%20Banky",
                            "2": "https://github.com/Darkluc05/Programming-2.3/tree/main/les1-2-5-cookie%20clicker",
                            "3": "",
                            "4": "https://github.com/Milouyg/Coaching" 
                        }
                    ]
                }
            ],
            "about": [
                {
                    "title": "About me",
                    "text": "I am a driven and ambitious individual, currently pursuing my academic journey as a student with a passion for web development. Fluent in both English and Dutch, I possess the unique ability to navigate seamlessly between these languages, enabling effective communication and collaboration in diverse, global settings.In my educational path, I've demonstrated my commitment to excellence by accelerating my progress through school. Skipping a year during my MBO studies, I showcased my dedication to learning and my ability to grasp complex concepts quickly. This ambition and determination are central to my approach to all aspects of my life.My skill set extends beyond web development. I have a knack for management and a proficiency in applying agile methodologies, particularly in the use of SCRUM. I have a natural aptitude for organizing tasks, setting priorities, and leading teams to success. My ability to effectively manage projects and teams complements my technical prowess, making me a well-rounded professional.My primary focus in web development has been on the frontend, where I have honed my skills to create engaging, intuitive, and responsive user interfaces using HTML, CSS, JavaScript, and frameworks like React. However, my true passion extends to backend development, where I aspire to delve deeper into server-side technologies and databases. My insatiable curiosity and commitment to growth drive me to continually expand my knowledge and apply it in practical contexts.I envision myself as an integral part of an innovative tech team, combining my frontend and backend skills to develop high-quality web applications. My goal is to contribute to the ever-evolving digital landscape, leveraging my technical expertise, management acumen, and the power of SCRUM to deliver exceptional results.As I continue on my journey in the tech industry, I am excited about the opportunities to learn, grow, and make a meaningful impact. My dedication, language proficiency, accelerated learning, and versatile skill set position me as a well-rounded and forward-thinking professional ready to take on the challenges of the digital world."
                }
            ]
        }
    ],
    "nederlands": [
        {
            "headers": [
                {
                    "0": "Skills",
                    "1": "Projecten",
                    "2": "Over mij",
                    "3": "Contact"
                }
            ],
            "reference": [
                {
                    "0": "skills",
                    "1": "projects",
                    "2": "about",
                    "3": "contact"
                }
            ],
            "title": [
                {
                    "0": [
                        {
                            "0": "Front End",
                            "1": "Developer"
                        }
                    ],
                    "1": [
                        {
                            "0": "Luc",
                            "1": "Zuidema"
                        }
                    ]
                }
            ],
            "skills": [
                {
                    "reference": [
                        {
                            "0": "html",
                            "1": "css",
                            "2": "Java script",
                            "3": "Scss",
                            "4": "Php"
                        }
                    ],
                    "image": [
                        {
                            "0": "./img/html.png",
                            "1": "./img/css.png",
                            "2": "./img/js.png",
                            "3": "./img/scss.png",
                            "4": "./img/php.png"
                        }
                    ],
                    "text": [
                        {
                            "0": "Ik bezit geavanceerde HTML-vaardigheden, waarbij de nadruk ligt op semantische HTML, BEM-naming voor onderhoudsvriendelijke code, SEO-optimalisatie en naleving van webtoegankelijkheid. Ik ben bedreven in responsief ontwerp, cross-browser compatibiliteit en versiebeheer, wat me tot een waardevolle aanwinst maakt voor visueel aantrekkelijke, toegankelijke en SEO-vriendelijke webontwikkeling.",
                            "1": "Ik bezit geavanceerde CSS-vaardigheden, waaronder schone en modulaire code, expertise in responsief ontwerp en kennis van CSS-methodologieën zoals BEM. Ik heb ervaring met CSS-preprocessors zoals SASS/SCSS, waardoor de productiviteit wordt verhoogd, en ik hecht veel belang aan webtoegankelijkheid en het naleven van WCAG-standaarden voor het creëren van visueel aantrekkelijke, gebruiksvriendelijke en responsieve webinterfaces.",
                            "2": "Mijn JavaScript-vaardigheden omvatten sterke expertise in Object-Oriented Programming (OOP) voor goed gestructureerde code. Ik blink uit in rendering met bibliotheken zoals React, beheer JSON-gebaseerde API's en hecht veel belang aan herbruikbare code voor efficiënte, op gegevens gebaseerde en interactieve webtoepassingen.",
                            "3": "Mijn SCSS-expertise verbetert CSS, waardoor ik efficiënte en onderhoudsvriendelijke stijlen kan creëren. Functies zoals variabelen, nesten, mixins en overerving zorgen voor schonere en georganiseerde code. Deze optimalisatie stroomlijnt de ontwikkeling en resulteert in visueel aantrekkelijke en schaalbare webinterfaces.",
                            "4": "Ik ben op weg om bekwaam te worden in PHP, momenteel in de trainingsfase met een diepe enthousiasme voor leren. Mijn basiskennis van PHP voorziet me van essentiële concepten en syntax voor webontwikkeling. Ik ben toegewijd aan het uitbreiden van mijn vaardigheden en kijk ernaar uit om de potentie van PHP te benutten voor het creëren van dynamische webtoepassingen. Mijn leertraject in PHP is nog gaande, en ik kijk uit naar de kansen voor groei en meesterschap terwijl ik blijf evolueren in dit dynamische vakgebied."
                        }
                    ]
                }
            ],
            "projects": [
                {
                    "title": "Projecten",
                    "reference": [
                        {
                            "0": "collection of happines",
                            "1": "banky",
                            "2": "Cookie Clicker",
                            "3": "eduLock",
                            "4": "Doesburg Coaching"
                        }
                    ],
                    "image": [
                        {
                            "0": "./img/happines.png",
                            "1": "./img/banky.png",
                            "2": "./img/cookie.png",
                            "3": "",
                            "4": "./img/doesburg.png"
                        }
                    ],
                    "text": [
                        {
                            "0": "Collection of happiness is een project uit periode 2.3 waarin we werden uitgedaagd om een lay-out te maken met meerdere nieuwsartikelen waar je tussen kon schakelen, het bijbehorende audio kon downloaden en de bron van dat artikel kon openen. Alles werd weergegeven in JS OOP. De artikelen worden willekeurig gekozen uit een vooraf bepaalde set artikelen om telkens een ander hoofdartikel te tonen bij elke herladen.",
                            "1": "Banky is een banktoepassing waar je eenvoudig kunt wisselen tussen accounts (dwz. verschillende datasets). Voor dit voorbeeld zijn er twee bankrekeningen (datasets) met een bijbehorende knop voor elke account, die automatisch wordt aangemaakt bij de aanmaak van een nieuwe account. Er is ook een vervagingsknop om ervoor te zorgen dat voorbijgangers geen gevoelige informatie kunnen zien.",
                            "2": "Cookie Clicker was mijn eerste project waarin ik OOP in JS gebruikte. We leerden hoe we herhaalde objecten konden maken en hoe we klassen konden aanmaken terwijl we alle elementen in JS rendeerden. Elke knop heeft zijn eigen functionaliteit, en het hoogtepunt is de opslaan-knop waarmee de huidige score en gebruikte mogelijkheden in de lokale opslag worden opgeslagen om dezelfde score te behouden wanneer je de pagina opnieuw laadt.",
                            "3": "EduLock is een nieuw bedrijf opgericht door 4 vrienden. Momenteel werken we aan het verzamelen van gegevens voor dit project en verdelen we taken binnen het team. We bestaan uit 2 front-end ontwikkelaars en 2 back-end ontwikkelaars. Momenteel ben ik een front-end ontwikkelaar en de projectmanager om ervoor te zorgen dat iedereen op de hoogte is van de huidige taak. We zijn nog geen officieel bedrijf, maar binnenkort dienen we ons idee in bij de KVK.",
                            "4": "Doesburg Coaching was een project ontworpen voor \"Cindy Doesburg\". Ze heeft een bedrijf dat werknemers helpt om uit burn-outs of andere mentale problemen te komen, zodat ze weer aan het werk kunnen. Ze gaf vier afzonderlijke oefeningen die ze op papier uitdeelde en die ze \"gedigitaliseerd\" wilde hebben. Deze werden gemaakt in een groep van vier, bestaande uit Jacob, Milou, Nabil en ik (Luc). Deze werden allemaal gemaakt met dezelfde coderingsstijl als Cookie Clicker en Banky, waarbij OOP werd gebruikt en items in JS werden weergegeven."
                        }
                    ],
                    "link": [
                        {
                            "0": "https://github.com/Darkluc05/collection-of-happines",
                            "1": "https://github.com/Darkluc05/Programming-2.3/tree/main/les7-8%20-%20Banky",
                            "2": "https://github.com/Darkluc05/Programming-2.3/tree/main/les1-2-5-cookie%20clicker",
                            "3": "",
                            "4": "https://github.com/Milouyg/Coaching" 
                        }
                    ]
                }
            ],
            "about": [
                {
                    "title": "Over mij",
                    "text": "I am a driven and ambitious individual, currently pursuing my academic journey as a student with a passion for web development. Fluent in both English and Dutch, I possess the unique ability to navigate seamlessly between these languages, enabling effective communication and collaboration in diverse, global settings.In my educational path, I've demonstrated my commitment to excellence by accelerating my progress through school. Skipping a year during my MBO studies, I showcased my dedication to learning and my ability to grasp complex concepts quickly. This ambition and determination are central to my approach to all aspects of my life.My skill set extends beyond web development. I have a knack for management and a proficiency in applying agile methodologies, particularly in the use of SCRUM. I have a natural aptitude for organizing tasks, setting priorities, and leading teams to success. My ability to effectively manage projects and teams complements my technical prowess, making me a well-rounded professional.My primary focus in web development has been on the frontend, where I have honed my skills to create engaging, intuitive, and responsive user interfaces using HTML, CSS, JavaScript, and frameworks like React. However, my true passion extends to backend development, where I aspire to delve deeper into server-side technologies and databases. My insatiable curiosity and commitment to growth drive me to continually expand my knowledge and apply it in practical contexts.I envision myself as an integral part of an innovative tech team, combining my frontend and backend skills to develop high-quality web applications. My goal is to contribute to the ever-evolving digital landscape, leveraging my technical expertise, management acumen, and the power of SCRUM to deliver exceptional results.As I continue on my journey in the tech industry, I am excited about the opportunities to learn, grow, and make a meaningful impact. My dedication, language proficiency, accelerated learning, and versatile skill set position me as a well-rounded and forward-thinking professional ready to take on the challenges of the digital world."
                }
            ]
        }
    ]
}